#+Title: Emacs configuration
#+Author: Delta Alexander Sharp
#+Email: nalisarc@gmail.com
* Projectile
https://github.com/bbatsov/projectile

#+name: projectile
#+begin_src emacs-lisp
(use-package projectile
  :bind-keymap
  ("C-c p" . projectile-command-map))
#+end_src

#+RESULTS: projectile
| lambda | nil | (interactive) | (use-package-autoload-keymap 'projectile-command-map 'projectile nil) |

* pdf tools
#+name: pdf-tools
#+begin_src emacs-lisp
(use-package pdf-tools
  :magic ("%PDF" . pdf-view-mode)
  :config
  (pdf-tools-install :no-query))
#+end_src

#+RESULTS: pdf-tools
: ((%PDF . pdf-view-mode))

* Nov
#+name: nov
#+begin_src emacs-lisp
(use-package nov
  :ensure-system-package fonts-opendyslexic
  :magic ("%EPUB" . nov-mode)
  :config
  (setq nov-text-width 90)
  (defun my-nov-font-setup ()
    (face-remap-add-relative 'variable-pitch :family "OpenDyslexic"
			     :height 1.0))
  (add-hook 'nov-mode-hook 'my-nov-font-setup)
  )
#+end_src

#+RESULTS:
: ((%EPUB . nov-mode) (%PDF . pdf-view-mode))


*** test
readtable error 47 will be the death of me.

By adding the above advice from https://github.com/gregsexton/ob-ipython/issues/135#issuecomment-478748897,
and ensuring that python has installed jupyter and that the elpy RPC exist
seems to make things work.

This seems to be repeatably usable though!!



#+begin_src ipython :session testy :results output 
import random
x = random.randint(0,10)
y = random.randint(10,100)
print(x + y)
#+end_src

#+RESULTS:
: 72


